/*
	File:		SlicesStrings.strings

	Contains:
	Copyright:	© 2007-2009 by Apple Inc., all rights reserved.
*/

//===========================================================================
// NOTE FOR LOCALIZERS:
// For any attributes overridden using the MDSlicesAttributeNameOverrides
// strings file, special care must be taken here. The KEY of the strings
// here will change from its english version to the name override.  For example:
//
// If MDSlicesAttributeNameOverrides.strings contains:
//		kMDItemTextContent = "TEXTCONTENT";
//
// Then replace any use of "Contents" (the english localization) in the KEYS
// of this file with the localization provided in MDSlicesAttributeNameOverrides.strings.
//
// In the above example, the localizer should change the text content localization below from:
//		"%[Contents]@ contains %@" = "%1$[Contents]@ contains %2$@";  // english version
//	to:
//		"%[TEXTCONTENT]@ contains %@" = "%1$[TEXTCONTENT]@ xxxxxx %2$@"; // localized version
//===========================================================================

/* Compound-type slices */
"%[Any]@ of the following are true" = "%1$[일부]@ 다음 조건이 적용됩니다";
"%[All]@ of the following are true" = "%1$[모든]@ 다음 조건이 적용됩니다";
"%[None]@ of the following are true" = "%1$[없음]@ 다음 조건이 적용됩니다";

/* Specific kind strings */
"%[Kind]@ is %[any]@" = "%1$[종류]@ 다음과 같음 %2$[모두]@";
"%[Kind]@ is %[applications]@" = "%1$[종류]@ 다음과 같음 %2$[응용 프로그램]@";
"%[Kind]@ is %[documents]@" = "%1$[종류]@ 다음과 같음 %2$[도큐멘트]@";
"%[Kind]@ is %[folders]@" = "%1$[종류]@ 다음과 같음 %2$[폴더]@";
"%[Kind]@ is %[images]@ %[all]@" = "%1$[종류]@ 다음과 같음 %3$[모든]@ %2$[이미지]@ ";
"%[Kind]@ is %[images]@ %[JPEG]@" = "%1$[종류]@ 다음과 같음 %3$[JPEG]@ %2$[이미지]@ ";
"%[Kind]@ is %[images]@ %[TIFF]@" = "%1$[종류]@ 다음과 같음 %3$[TIFF]@ %2$[이미지]@ ";
"%[Kind]@ is %[images]@ %[GIF]@" = "%1$[종류]@ 다음과 같음 %3$[GIF]@ %2$[이미지]@ ";
"%[Kind]@ is %[images]@ %[PNG]@" = "%1$[종류]@ 다음과 같음 %3$[PNG]@ %2$[이미지]@ ";
"%[Kind]@ is %[images]@ %[BMP]@" = "%1$[종류]@ 다음과 같음 %3$[BMP]@ %2$[이미지]@ ";
"%[Kind]@ is %[music]@ %[all]@" = "%1$[종류]@ 다음과 같음 %3$[모든]@ %2$[음악]@ ";
"%[Kind]@ is %[music]@ %[MP3]@" = "%1$[종류]@ 다음과 같음 %3$[MP3]@ %2$[음악]@ ";
"%[Kind]@ is %[music]@ %[AAC]@" = "%1$[종류]@ 다음과 같음 %3$[AAC]@ %2$[음악]@ ";
"%[Kind]@ is %[music]@ %[purchased]@" = "%1$[종류]@ 다음과 같음 %3$[구입한]@ %2$[음악]@ ";
"%[Kind]@ is %[PDF]@" = "%1$[종류]@ 다음과 같음 %2$[PDF]@";
"%[Kind]@ is %[presentations]@" = "%1$[종류]@ 다음과 같음 %2$[프레젠테이션]@";
"%[Kind]@ is %[text]@ %[all]@" = "%1$[종류]@ 다음과 같음 %3$[모든]@ %2$[텍스트]@ ";
"%[Kind]@ is %[text]@ %[plain text]@" = "%1$[종류]@ 다음과 같음 %3$[일반 텍스트의]@ %2$[텍스트]@ ";
"%[Kind]@ is %[text]@ %[rich text]@" = "%1$[종류]@ 다음과 같음 %3$[리치 텍스트의]@ %2$[텍스트]@ ";
"%[Kind]@ is %[text]@ %[HTML]@" = "%1$[종류]@ 다음과 같음 %3$[HTML]@ %2$[텍스트]@ ";
"%[Kind]@ is %[text]@ %[XML]@" = "%1$[종류]@ 다음과 같음 %3$[XML]@ %2$[텍스트]@ ";
"%[Kind]@ is %[text]@ %[source code]@" = "%1$[종류]@ 다음과 같음 %3$[소스 코드]@ %2$[텍스트]@ ";
"%[Kind]@ is %[movies]@" = "%1$[종류]@ 다음과 같음 %2$[동영상]@";
"%[Kind]@ is %[other]@ %@" = "%1$[종류]@ 다음과 같음 %2$[기타]@ %3$@";

/* date-type attribute template, like kMDItemContentCreationDate */
"%@ is %[within last]@ %@ %[days]@" = "%1$@이(가) %2$[최근]@ %3$@ %4$[일 내]@";
"%@ is %[within last]@ %@ %[weeks]@" = "%1$@이(가) %2$[최근]@ %3$@ %4$[주 내]@";
"%@ is %[within last]@ %@ %[months]@" = "%1$@이(가) %2$[최근]@ %3$@ %4$[달 내]@";
"%@ is %[within last]@ %@ %[years]@" = "%1$@이(가) %2$[최근]@ %3$@ %4$[년 내]@";
"%@ is %[exactly]@ %@" = "%1$@이(가) %2$[정확히 다음 날짜]@ %3$@";
"%@ is %[before]@ %@" = "%1$@이(가) %2$[다음 날짜 전]@ %3$@";
"%@ is %[after]@ %@" = "%1$@이(가) %2$[다음 날짜 후]@ %3$@";
"%@ is %[today]@" = "%1$@이(가) %2$[오늘]@";
"%@ is %[yesterday]@" = "%1$@이(가) %2$[어제]@";
"%@ is %[this week]@" = "%1$@이(가) %2$[이번 주]@";
"%@ is %[this month]@" = "%1$@이(가) %2$[이번 달]@";
"%@ is %[this year]@" = "%1$@이(가) %2$[올해]@";

/* string-type attribute, like kMDItemDisplayName */
"%@ %[contains]@ %@" = "%1$@ %2$[다음을 포함]@ %3$@";
"%@ %[begins with]@ %@" = "%1$@ %2$[다음으로 시작]@ %3$@";
"%@ %[ends with]@ %@" = "%1$@ %2$[다음으로 끝남]@ %3$@";
"%@ %[is]@ %@" = "%1$@ %2$[다음과 같음]@ %3$@";
"%@ %[matches]@ %@" = "%1$@ %2$[다음과 일치]@ %3$@";

/* boolean-type attribute, like kMDItemFlashOnOff */
"%@ %[any]@" = "%1$@ %2$[모두]@";
"%@ %[yes]@" = "%1$@ %2$[있음]@";
"%@ %[no]@" = "%1$@ %2$[없음]@";

/* file visibility */
"%[File invisible]@ %[visible items]@" = "%1$[파일 가시성]@ %2$[보이는 항목]@";
"%[File invisible]@ %[invisible items]@" = "%1$[파일 가시성]@ %2$[보이지 않는 항목]@";
"%[File invisible]@ %[visible or invisible]@" = "%1$[파일 가시성]@ %2$[보임 또는 보이지 않음]@";

/* raw query slice */
"%[Raw query]@ %@" = "%1$[원본 질의]@ %2$@";

/* file extension slice */
"%[File Extension]@ %[is]@ %@" = "%1$[파일 확장자]@ %2$[다음과 같음]@ %3$@";

/* number-type attribute, like kMDItemAudioChannelCount */
"%@ %[equals]@ %@" = "%1$@ %2$[다음과 같음]@ %3$@";
"%@ %[is greater than]@ %@" = "%1$@ %2$[다음보다 큼]@ %3$@";
"%@ %[is less than]@ %@" = "%1$@ %2$[다음보다 작음]@ %3$@";
"%@ %[is not]@ %@" = "%1$@ %2$[다음이 아님]@ %3$@";

/* text contents */
"%@ contains %@" = "%1$@이(가) %2$@을(를) 포함";

/* Byte-sized attributes, such as kMDItemFSSize */
"%@ %[equals]@ %@ %[KB]@" = "%1$@ %2$[다음과 같음]@ %3$@ %4$[KB]@";
"%@ %[equals]@ %@ %[MB]@" = "%1$@ %2$[다음과 같음]@ %3$@ %4$[MB]@";
"%@ %[equals]@ %@ %[GB]@" = "%1$@ %2$[다음과 같음]@ %3$@ %4$[GB]@";
"%@ %[is less than]@ %@ %[KB]@" = "%1$@ %2$[다음보다 작음]@ %3$@ %4$[KB]@";
"%@ %[is less than]@ %@ %[MB]@" = "%1$@ %2$[다음보다 작음]@ %3$@ %4$[MB]@";
"%@ %[is less than]@ %@ %[GB]@" = "%1$@ %2$[다음보다 작음]@ %3$@ %4$[GB]@";
"%@ %[is greater than]@ %@ %[KB]@" = "%1$@ %2$[다음보다 큼]@ %3$@ %4$[KB]@";
"%@ %[is greater than]@ %@ %[MB]@" = "%1$@ %2$[다음보다 큼]@ %3$@ %4$[MB]@";
"%@ %[is greater than]@ %@ %[GB]@" = "%1$@ %2$[다음보다 큼]@ %3$@ %4$[GB]@";
"%@ %[is not]@ %@ %[KB]@" = "%1$@ %2$[다음이 아님]@ %3$@ %4$[KB]@";
"%@ %[is not]@ %@ %[MB]@" = "%1$@ %2$[다음이 아님]@ %3$@ %4$[MB]@";
"%@ %[is not]@ %@ %[GB]@" = "%1$@ %2$[다음이 아님]@ %3$@ %4$[GB]@";

/* Duration-type attributes, such as kMDItemDurationSeconds */
"%@ %[equals]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[다음과 같음]@ %3$@시간 %4$@분 %5$@초";
"%@ %[is less than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[다음보다 작음]@ %3$@시간 %4$@분 %5$@초";
"%@ %[is greater than]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[다음보다 큼]@ %3$@시간 %4$@분 %5$@초";
"%@ %[is not]@ %@ hours %@ minutes %@ seconds" = "%1$@ %2$[다음이 아님]@ %3$@시간 %4$@분 %5$@초";

/* This is for the slice that is added when a search string is present in the search field when saving a search. */
"%[Items matching text]@ %@" = "%1$[다음 텍스트와 일치하는 항목]@ %2$@";

/* Search System Files slice */
"%[SEARCH_SYSTEM_FILES]@ %[YES]@" = "%1$[시스템 파일]@ %2$[포함]@";
"%[SEARCH_SYSTEM_FILES]@ %[NO]@" = "%1$[시스템 파일]@ %2$[포함 안 함]@";

/* Spotlight items slice */
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[YES]@" = "%1$[Spotlight 항목]@ %2$[포함]@";
"%[SEARCH_SPOTLIGHT_ITEMS]@ %[NO]@" = "%1$[Spotlight 항목]@ %2$[포함 안 함]@";

